close all;
clear;
clc;

%% Аппроксимация статической характеристики прямой передачи
% интервал от 0 до 2.8 с шагом 0.1

a0 = 0;
a1 = -0.094;
a2 = 0.047;
a3 = 2;
a4 = -0.5;
Um = 0.25;

u = 0:0.1:2.8;
i = a0 + a1 * u + a2 * u.^2 + a3 * u.^3 + a4 * u.^4;

% ВАХ амплитудного базового модулятора на НЭ
figure('Name','ВАХ амплитудного базового модулятора на НЭ');
plot(u,i,'black','LineWidth',2);
grid on;
xlabel('u, B');
ylabel('i, мА');

% Статическая модуляционная характеристика(СМХ)
% E = u, так как пределы одинаковы
I1 = a1 * Um + 2 * a2 * u * Um + 3 * a3 * u.^2 * Um + 0.75 * a3 * Um.^3 + 4 * a4 * u.^3 * Um + 3 * a4 * u * Um.^3;

% Статическая модуляционная характеристика(СМХ)
% построение графика
figure('Name','Статическая модуляционная характеристика(СМХ)');
plot(u,I1,'black','LineWidth',2);
grid on;
xlabel('E, B');
ylabel('i, мА');


% uн (от 0 до 1 с шагом 0.1)
un = 0:0.1:1;
E0 = 1;

% Амплитуда тока несущей частоты в отсутствии модуляции
I1n = a1 * Um + 0.75 * a3 * Um.^3 + 2 * a2 * Um * E0 + 3 * a4 * Um.^3 * E0 + 3 * a3 * Um * E0.^2 + 1.5 * a3 * Um * un.^2 + 4 * a4 * Um * E0.^3 + 6 * a4 * Um * E0 * un.^2;

% Амплитудаполезной составляющей спектра, огибающей
I1f = 2 * a2 * Um * un + 3 * a4 * Um.^3 * un + 6 * a3 * Um * E0 * un + 12 * a4 * Um * E0.^2 * un + 3 * a4 * Um * un.^3;

% Амплитуда высших гармоник модулирующей частоты
I2f = 1.5 * a3 * Um * un.^2 + 6 * a4 * Um * E0 * un.^2;
I3f = a4 * Um * un.^3;

% Коэффициент нелинейных искажений огибающей тока первой гармоники
Kni = (sqrt(I2f.^2 + I3f.^2))./I1f;

% Глубина модуляции тока первой гармоники
M1 = I1f./I1n;

% Uн
% построение графика
figure('Name','Uн');
hold on;
plot(un,Kni,'black','LineWidth',2);
grid on;
plot(un,M1,'black','LineWidth',2);
grid on;

grid on;
xlabel('Uнч, B');
ylabel('Kni, M1, Kni(M1)');

% Uн
% построение графика
figure('Name','Uн');
hold on;
plot(un,Kni,'black','LineWidth',2);
grid on;
plot(M1,Kni,'black','LineWidth',2);
grid on;
xlabel('Uнч, B');
ylabel('Kni, Kni(M1)');

% Uн
% построение графика
figure('Name','Kни');
plot(un,Kni,'black','LineWidth',2);
grid on;
xlabel('Uнч, B');
ylabel('Kni');

% Начальные условия для рассчёта
T = 1.6 * 10^(-3);
k = 0:1:25;
tau = 0.4 * 10^(-3);

% Рассчёт частоты
y = (2 * 3.14) / T

%%% Коэффициенты


% Вольт-фарадная характеристика
u = -1:-1:-20;
cd = (a0 + a1 * u + a2 * u./2 + a3 * u.^3)*10^(-12);

% построение графика
figure('Name','Вольт-фарадная характеристика');
plot(u,cd,'black','LineWidth',2);
grid on;
xlabel('u, B');
ylabel('Cd');

fu= 1 ./ (2 * 3.14 * sqrt(1*10^(-3)*(4.4209*10^(-13) + cd)));

% построение графика
figure('Name','');
plot(u,1./(5*3.14*(1*10^(-3)*(4.4209*10^(-13)+cd))),'black','LineWidth',2);
grid on;
xlabel('u, B');
ylabel('f');